## 파일 입출력
- read_csv() : https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html
- 그 외 파일 형식 불러오기 자료 : https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html

## csv파일 불러오고 내보내는 메서드를 꼭 기억하자!!!! 너무 중요하다!!!!! 경로를 잘보는 것도 중요!!!

## submission = pd.read_csv(DATA_PATH + 'sample_submission.csv')
- DATA_PATH는 우리가 넣고자하는 파일의 절대경로이다. 
- 이것을 전역변수로 지정해서 절대경로를 만들어주면 나중에 설정하기 편하다
- pd.read_csv('PATH')는 판다스에서 csv파일을 불러오는 메서드이다.
- 즉 파일을 불러오기 위해서는 pd.read_csv('PATH')메서드를 쓰고 PATH에다가 불러올 파일의 경로를 복사해서 적어주면 된다.

## result.to_csv('result.csv', index=False), index=False 시, index 번호를 열로 추출 안하게 된다.
- projectDS 내에 폴더로 내보내기 되어진다. 
- result.to_csv('PATH', index=False)는 result.to_csv()안에 첫번째 매개변수는 내보내기 하는 PATH의 경로가 된다.
- '파일명'.to_csv('PATH')는 csv파일을 내보내는 메서드이다.
- 즉 파일을 내보내기 위해서는 '파일명'.to_csv('PATH')메서드를 쓰고 PATH에다가 우리가 내보내길 원하는 폴더에 경로를 적어주면 된다.

In [3]:
import pandas as pd

DATA_PATH = 'playground-series-s4e1/'
# DATA_PATH는 우리가 넣고자하는 파일의 경로이다. 여기서는 playground의 폴더 경로이다. 
# 이것을 전역변수로 지정해서 절대경로를 만들어주면 나중에 설정하기 편하다

train = pd. read_csv(DATA_PATH + 'train.csv')
test = pd.read_csv(DATA_PATH + 'test.csv')
submission = pd.read_csv(DATA_PATH + 'sample_submission.csv')
# pd.read_csv('PATH')는 판다스에서 csv파일을 불러오는 메서드이다.
# 즉 파일을 불러오기 위해서는 pd.read_csv('PATH')메서드를 쓰고 PATH에다가 불러올 파일의 경로를 적어주면 된다.

In [4]:
train.head()

,id,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,0,15674932,Okwudilichukwu,668,France,Male,33.0,3,0.00,2,1.0,0.0,181449.97,0
1,1,15749177,Okwudiliolisa,627,France,Male,33.0,1,0.00,2,1.0,1.0,49503.50,0
2,2,15694510,Hsueh,678,France,Male,40.0,10,0.00,2,1.0,0.0,184866.69,0
3,3,15741417,Kao,581,France,Male,34.0,2,148882.54,1,1.0,1.0,84560.88,0
4,4,15766172,Chiemenam,716,Spain,Male,33.0,5,0.00,2,1.0,1.0,15068.83,0

In [6]:
result = train.loc[:, ['id','Age']]
result.to_csv('result.csv', index=False) # index=False 시, index 번호를 열로 추출 안하게 된다.
# projectDS 내에 폴더로 내보내기 되어진다. 
# result.to_csv('path', index=False)는 result.to_csv()안에 첫번째 매개변수는 내보내기 하는 path의 경로가 된다.
# '파일명'.to_csv('PATH')는 csv파일을 내보내는 메서드이다.
# 즉 파일을 내보내기 위해서는 '파일명'.to_csv('PATH')메서드를 쓰고 PATH에다가 우리가 내보내길 원하는 폴더에 경로를 적어주면 된다.

In [7]:
titanic = pd.read_csv("https://raw.githubusercontent.com/pandas-dev/pandas/main/doc/data/titanic.csv")

In [9]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# 문자열 column을 다루는 기본적인 방법(실무)

In [18]:
titanic['Name'].str.lower()

0                                braund, mr. owen harris
1      cumings, mrs. john bradley (florence briggs th...
2                                 heikkinen, miss. laina
3           futrelle, mrs. jacques heath (lily may peel)
4                               allen, mr. william henry
                             ...
886                                montvila, rev. juozas
887                         graham, miss. margaret edith
888             johnston, miss. catherine helen "carrie"
889                                behr, mr. karl howell
890                                  dooley, mr. patrick
Name: Name, Length: 891, dtype: object

In [19]:
titanic['Name'].str.split(",")

0                             [Braund,  Mr. Owen Harris]
1      [Cumings,  Mrs. John Bradley (Florence Briggs ...
2                              [Heikkinen,  Miss. Laina]
3        [Futrelle,  Mrs. Jacques Heath (Lily May Peel)]
4                            [Allen,  Mr. William Henry]
                             ...
886                             [Montvila,  Rev. Juozas]
887                      [Graham,  Miss. Margaret Edith]
888          [Johnston,  Miss. Catherine Helen "Carrie"]
889                             [Behr,  Mr. Karl Howell]
890                               [Dooley,  Mr. Patrick]
Name: Name, Length: 891, dtype: object

In [22]:
titanic["Surname"]=titanic['Name'].str.split(",").str.get(0)
# ==> str.get(n) 메서드를 생각해보자.
# ==> 위 예시는 ","로 split시키고 분리되어진 리스트안에 0번째 인덱스를 가져오는 경우였다.
titanic["Surname"]

0         Braund
1        Cumings
2      Heikkinen
3       Futrelle
4          Allen
         ...
886     Montvila
887       Graham
888     Johnston
889         Behr
890       Dooley
Name: Surname, Length: 891, dtype: object

In [25]:
titanic["Name"].str.contains("Countess")

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Name, Length: 891, dtype: bool

In [26]:
titanic[titanic['Name'].str.contains("Countess")]
# ==> Name이라는 column에 Countess가 포함되어있는지 찾아서 True와False값을 주는 메서드이다.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname
759,760,1,1,"Rothes, the Countess. of (Lucy Noel Martha Dye...",female,33.0,0,0,110152,86.5,B77,S,Rothes

In [27]:
titanic.loc[759, :]

PassengerId                                                  760
Survived                                                       1
Pclass                                                         1
Name           Rothes, the Countess. of (Lucy Noel Martha Dye...
Sex                                                       female
Age                                                         33.0
SibSp                                                          0
Parch                                                          0
Ticket                                                    110152
Fare                                                        86.5
Cabin                                                        B77
Embarked                                                       S
Surname                                                   Rothes
Name: 759, dtype: object

In [28]:
titanic["Name"].str.len()

0      23
1      51
2      22
3      44
4      24
       ..
886    21
887    28
888    40
889    21
890    19
Name: Name, Length: 891, dtype: int64

In [29]:
titanic['Name'].str.len().idxmax()
# ==> idxmax() 메서드도 str 메서드를 안써도 된다. 이 메서드는 인덱스의 최대값을 가져오는 메서드이다.

307

In [32]:
titanic.loc[titanic['Name'].str.len().idxmax(), ['Name']]

Name    Penasco y Castellana, Mrs. Victor de Satode (M...
Name: 307, dtype: object

In [35]:
titanic["sex_short"] = titanic['Sex'].replace({'female' : 'F' , 'male' : 'M'})
# ==> str 메서드를 안써도 된다. 몇몇 str을 안서도 되는 메서드가 있다.

In [36]:
titanic['sex_short']

0      M
1      F
2      F
3      F
4      M
      ..
886    M
887    F
888    F
889    M
890    M
Name: sex_short, Length: 891, dtype: object